SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
avrda.menu.printf.default=Default, 1.5k flash, no floats
avrda.menu.printf.full=Full, 2.6k, prints floats
avrda.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.printf.full.build.printfabr=.pfF
avrda.menu.printf.minimal=Minimal, 1.1k flash used
avrda.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
avrda.menu.optimization.size=-Os (size)
avrda.menu.optimization.sizegcse=-Os (size, no GCSE)
avrda.menu.optimization.o3=-O3 (speed)
avrda.menu.optimization.o3gcse=-O3 (speed, no GCSE)
avrda.menu.optimization.size.build.optimizationlevel=-Os
avrda.menu.optimization.sizegcse.build.optimizationlevel=-Os
avrda.menu.optimization.o3.build.optimizationlevel=-O3
avrda.menu.optimization.o3gcse.build.optimizationlevel=-O3
avrda.menu.optimization.size.build.optabr=.Os
avrda.menu.optimization.sizegcse.build.optabr=.Osng
avrda.menu.optimization.o3.build.optabr=.O3
avrda.menu.optimization.o3gcse.build.optabr=.O3ng
avrda.menu.optimization.sizegcse.build.gcse=-fno-gcse
avrda.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrda.menu.attach.allenabled=On all pins, with new implementation.
avrda.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrda.menu.attach.manual=Only enabled ports. Please see documentation
avrda.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrda.menu.attach.oldversion=Old version, (may fix bugs)
avrda.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrda.menu.attach.manual.build.attachabr=.aMan
avrda.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrda.menu.startuptime.8=8ms
avrda.menu.startuptime.1=0ms
avrda.menu.startuptime.1=1ms
avrda.menu.startuptime.2=2ms
avrda.menu.startuptime.4=4ms
avrda.menu.startuptime.16=16ms
avrda.menu.startuptime.32=32ms
avrda.menu.startuptime.64=64ms
avrda.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrda.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrda.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrda.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrda.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrda.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrda.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrda.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrda.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrda.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrda.menu.wiremode.mors.build.wireabr=.wO
avrda.menu.wiremode.mands=1x Wire, Master and Slave
avrda.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrda.menu.wiremode.mands.build.wireabr=.wA
avrda.menu.wiremode.mors2=2x Wire, Master or Slave (32+ pin devices only)
avrda.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrda.menu.wiremode.mors2.build.wireabr=.wO2
avrda.menu.wiremode.mands2=2x Wire, Master and Slave (32+ pin devices only)
avrda.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrda.menu.wiremode.mands2.build.wireabr=.wA2

#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
avrda.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrda.menu.appspm.no.bootloader.appspm=
avrda.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrda.menu.appspm.no.build.appspmabr=
avrda.menu.appspm.full=Anywhere after 0x0200 (Warning: App allowed to overwrite itself)
avrda.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrda.menu.appspm.full.build.appspmabr=.spmALL
avrda.menu.appspm.16plus=Above 16k
avrda.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrda.menu.appspm.16plus.bootloader.CODESIZE=32
avrda.menu.appspm.24plus=Above 24k
avrda.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrda.menu.appspm.24plus.bootloader.CODESIZE=48
avrda.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrda.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrda.menu.appspm.32plus.bootloader.CODESIZE=64
avrda.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrda.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrda.menu.appspm.48plus.bootloader.CODESIZE=96
avrda.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrda.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrda.menu.appspm.56plus.bootloader.CODESIZE=112
avrda.menu.appspm.60plus=Above 60k (AVR128/64 only)
avrda.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrda.menu.appspm.60plus.bootloader.CODESIZE=120
avrda.menu.appspm.64plus=Above 64k (AVR128 only)
avrda.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrda.menu.appspm.64plus.bootloader.CODESIZE=128
avrda.menu.appspm.80plus=Above 80k (AVR128 only)
avrda.menu.appspm.80plus.bootloader.appspm=-DSPM_FROM_APP=160
avrda.menu.appspm.80plus.bootloader.CODESIZE=160
avrda.menu.appspm.96plus=Above 96k (AVR128 only)
avrda.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrda.menu.appspm.96plus.bootloader.CODESIZE=192
avrda.menu.appspm.112plus=Above 112k (AVR128 only)
avrda.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrda.menu.appspm.112plus.bootloader.CODESIZE=224
avrda.menu.appspm.120plus=Above 120k (AVR128 only)
avrda.menu.appspm.120plus.bootloader.appspm=-DSPM_FROM_APP=240
avrda.menu.appspm.120plus.bootloader.CODESIZE=240

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrda.menu.WDTtimeout.disabled=Disabled (recommended)
avrda.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrda.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrda.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrda.menu.WDTtimeout.1second=Window remains open for 1 Second
avrda.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrda.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrda.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrda.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrda.menu.WDTwindow.disabled=No delay before window "opens"
avrda.menu.WDTwindow.8seconds=8 Second before window "opens"
avrda.menu.WDTwindow.4seconds=4 Second before window "opens"
avrda.menu.WDTwindow.2seconds=2 Second before window "opens"
avrda.menu.WDTwindow.1second=1 Second before window "opens"
avrda.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrda.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrda.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrda.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrda.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrda.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrda.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrda.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrda.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrda.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrda.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrda.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrda.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrda.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrda.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrda.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrda.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrda.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrda.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrda.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrda.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrda.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # ####              #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DB parts   #
#________________________________________#
avrdb.upload.tool=avrdude
avrdb.upload.prog_interlock=
avrdb.build.board=avrdb
avrdb.build.mvioenable=-DMVIO_ENABLED
avrdb.build.core=dxcore
avrdb.upload.maximum_size=0
avrdb.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdb.build.f_cpu={build.speed}000000L
avrdb.build.text_section_start=.text=0x0
avrdb.build.extra_flags= {bootloader.appspm} {build.mvioenable}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=
avrdb.build.printf=
avrdb.build.optimizationlevel=-Os
avrdb.build.gcse=
avrdb.build.attachmode=-DCORE_ATTACH_ALL

