SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdb.menu.bodvoltage.1v9=1.9V
avrdb.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb.menu.bodvoltage.2v45=2.45V
avrdb.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb.menu.bodvoltage.2v70=2.70V
avrdb.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb.menu.bodvoltage.2v85=2.85V
avrdb.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb.menu.bodmode.disabled=Disabled/Disabled
avrdb.menu.bodmode.enabled=Enabled/Enabled
avrdb.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdb.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdb.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdb.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdb.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdb.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdb.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdb.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdb.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdb.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdb.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdb.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdb.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdb.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdb.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdb.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrdb.menu.eesave.enable=EEPROM retained
avrdb.menu.eesave.enable.bootloader.eesavebit=1
avrdb.menu.eesave.disable=EEPROM not retained
avrdb.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdb.menu.resetpin.reset=Hardware Reset (recommended)
avrdb.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb.menu.resetpin.input=Input
avrdb.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdb.menu.millis.tcb2=TCB2 (recommended)
avrdb.menu.millis.disabled=Disabled (delay() only)
avrdb.menu.millis.tcb0=TCB0
avrdb.menu.millis.tcb1=TCB1
avrdb.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdb.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdb.menu.millis.tca0=TCA0
avrdb.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdb.menu.millis.tcb0.build.millistimer=B0
avrdb.menu.millis.tcb1.build.millistimer=B1
avrdb.menu.millis.tcb2.build.millistimer=B2
avrdb.menu.millis.tcb3.build.millistimer=B3
avrdb.menu.millis.tcb4.build.millistimer=B4
avrdb.menu.millis.tca0.build.millistimer=A0
avrdb.menu.millis.tca1.build.millistimer=A1
avrdb.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdb.menu.printf.default=Default, 1.5k flash, no floats
avrdb.menu.printf.default.build.printf=
avrdb.menu.printf.full=Full, 2.6k, prints floats
avrdb.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.printf.full.build.printfabr=.pfF
avrdb.menu.printf.minimal=Minimal, 1.1k flash used
avrdb.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
avrdb.menu.optimization.size=-Os (size)
avrdb.menu.optimization.sizegcse=-Os (size, no GCSE)
avrdb.menu.optimization.o3=-O3 (speed)
avrdb.menu.optimization.o3gcse=-O3 (speed, no GCSE)
avrdb.menu.optimization.size.build.optimizationlevel=-Os
avrdb.menu.optimization.sizegcse.build.optimizationlevel=-Os
avrdb.menu.optimization.o3.build.optimizationlevel=-O3
avrdb.menu.optimization.o3gcse.build.optimizationlevel=-O3
avrdb.menu.optimization.size.build.optabr=.Os
avrdb.menu.optimization.sizegcse.build.optabr=.Osng
avrdb.menu.optimization.o3.build.optabr=.O3
avrdb.menu.optimization.o3gcse.build.optabr=.O3ng
avrdb.menu.optimization.sizegcse.build.gcse=-fno-gcse
avrdb.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdb.menu.attach.allenabled=On all pins, with new implementation.
avrdb.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdb.menu.attach.manual=Only enabled ports. Please see documentation.
avrdb.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdb.menu.attach.oldversion=Old version, may fix bugs.
avrdb.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdb.menu.attach.manual.build.attachabr=.aMan
avrdb.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
avrdb.menu.mvio.enabled=Enabled
avrdb.menu.mvio.enabled.bootloader.mviobits=01
avrdb.menu.mvio.enabled.build.mvioenable=-DMVIO_ENABLED
avrdb.menu.mvio.disabled=Disabled
avrdb.menu.mvio.disabled.bootloader.mviobits=10
avrdb.menu.mvio.disabled.build.mvioenable=

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdb.menu.startuptime.8=8ms
avrdb.menu.startuptime.0=0ms
avrdb.menu.startuptime.1=1ms
avrdb.menu.startuptime.2=2ms
avrdb.menu.startuptime.4=4ms
avrdb.menu.startuptime.16=16ms
avrdb.menu.startuptime.32=32ms
avrdb.menu.startuptime.64=64ms
avrdb.menu.startuptime.0.bootloader.sutbits=000
avrdb.menu.startuptime.1.bootloader.sutbits=001
avrdb.menu.startuptime.2.bootloader.sutbits=010
avrdb.menu.startuptime.4.bootloader.sutbits=011
avrdb.menu.startuptime.8.bootloader.sutbits=100
avrdb.menu.startuptime.16.bootloader.sutbits=101
avrdb.menu.startuptime.32.bootloader.sutbits=110
avrdb.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdb.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdb.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdb.menu.wiremode.mors.build.wireabr=.wO
avrdb.menu.wiremode.mands=1x Wire, Master and Slave
avrdb.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdb.menu.wiremode.mands.build.wireabr=.wA
avrdb.menu.wiremode.mors2=2x Wire, Master or Slave (32+ pin devices only)
avrdb.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdb.menu.wiremode.mors2.build.wireabr=.wO2
avrdb.menu.wiremode.mands2=2x Wire, Master and Slave (32+ pin devices only)
avrdb.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdb.menu.wiremode.mands2.build.wireabr=.wA2

