SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
avrdb.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrdb.menu.appspm.no.bootloader.appspm=
avrdb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdb.menu.appspm.no.build.appspmabr=
avrdb.menu.appspm.full=Anywhere after 0x0200 (Warning: App allowed to overwrite itself)
avrdb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdb.menu.appspm.full.build.appspmabr=.spmALL
avrdb.menu.appspm.16plus=Above 16k
avrdb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdb.menu.appspm.16plus.bootloader.CODESIZE=32
avrdb.menu.appspm.24plus=Above 24k
avrdb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdb.menu.appspm.24plus.bootloader.CODESIZE=48
avrdb.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrdb.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdb.menu.appspm.32plus.bootloader.CODESIZE=64
avrdb.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrdb.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdb.menu.appspm.48plus.bootloader.CODESIZE=96
avrdb.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrdb.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdb.menu.appspm.56plus.bootloader.CODESIZE=112
avrdb.menu.appspm.60plus=Above 60k (AVR128/64 only)
avrdb.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrdb.menu.appspm.60plus.bootloader.CODESIZE=120
avrdb.menu.appspm.64plus=Above 64k (AVR128 only)
avrdb.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdb.menu.appspm.64plus.bootloader.CODESIZE=128
avrdb.menu.appspm.80plus=Above 80k (AVR128 only)
avrdb.menu.appspm.80plus.bootloader.appspm=-DSPM_FROM_APP=160
avrdb.menu.appspm.80plus.bootloader.CODESIZE=160
avrdb.menu.appspm.96plus=Above 96k (AVR128 only)
avrdb.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdb.menu.appspm.96plus.bootloader.CODESIZE=192
avrdb.menu.appspm.112plus=Above 112k (AVR128 only)
avrdb.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdb.menu.appspm.112plus.bootloader.CODESIZE=224
avrdb.menu.appspm.120plus=Above 120k (AVR128 only)
avrdb.menu.appspm.120plus.bootloader.appspm=-DSPM_FROM_APP=240
avrdb.menu.appspm.120plus.bootloader.CODESIZE=240

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdb.menu.WDTtimeout.disabled=Disabled (recommended)
avrdb.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdb.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdb.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdb.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdb.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdb.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdb.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdb.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdb.menu.WDTwindow.disabled=No delay before window "opens"
avrdb.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdb.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdb.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdb.menu.WDTwindow.1second=1 Second before window "opens"
avrdb.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdb.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdb.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdb.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdb.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdb.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdb.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdb.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdb.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdb.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdb.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdb.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdb.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdb.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdb.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdb.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdb.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdb.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdb.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdb.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdb.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdb.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
avrdd.upload.tool=avrdude
avrdd.upload.prog_interlock=
avrdd.build.board=avrdd
avrdd.build.mvioenable=-DMVIO_ENABLED
avrdd.build.core=dxcore
avrdd.upload.maximum_size=0
avrdd.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdd.build.f_cpu={build.speed}000000L
avrdd.build.text_section_start=.text=0x0
avrdd.build.defaultswaps=
avrdd.build.extra_flags= {bootloader.appspm} {build.mvioenable} {build.defaultswaps}
avrdd.build.export_merged_output=false
avrdd.build.highestcb=B2
avrdd.build.printf=
avrdd.build.optimizationlevel=-Os
avrdd.build.gcse=
avrdd.build.attachmode=-DCORE_ATTACH_ALL

