SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdaopti.menu.startuptime.8=8ms
avrdaopti.menu.startuptime.1=0ms
avrdaopti.menu.startuptime.1=1ms
avrdaopti.menu.startuptime.2=2ms
avrdaopti.menu.startuptime.4=4ms
avrdaopti.menu.startuptime.16=16ms
avrdaopti.menu.startuptime.32=32ms
avrdaopti.menu.startuptime.64=64ms
avrdaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrdaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdaopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdaopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdaopti.menu.wiremode.mors.build.wireabr=.wO
avrdaopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdaopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdaopti.menu.wiremode.mands.build.wireabr=.wA
avrdaopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdaopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdaopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdaopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdaopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdaopti.menu.wiremode.mands2.build.wireabr=.wA2

#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrdaopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdaopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdaopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdaopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdaopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (>28 pin only)
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1


#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdaopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrdaopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdaopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdaopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdaopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdaopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdaopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdaopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdaopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdaopti.menu.WDTwindow.disabled=No delay before window "opens"
avrdaopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdaopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdaopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdaopti.menu.WDTwindow.1second=1 Second before window "opens"
avrdaopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdaopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdaopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdaopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdaopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdaopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdaopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdaopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdaopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdaopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdaopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdaopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdaopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdaopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdaopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdaopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdaopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdaopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdaopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdaopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdaopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdaopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # ####           #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DB parts   #
#________________________________________#
avrdbopti.build.board=avrdb
avrdbopti.build.mvioenable=-DMVIO_ENABLED
avrdbopti.build.core=dxcore
avrdbopti.upload.maximum_size=0
avrdbopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdbopti.build.f_cpu={build.speed}000000L
avrdbopti.build.text_section_start=.text=0x200
avrdbopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT {build.mvioenable}
avrdbopti.build.export_merged_output=true
avrdbopti.build.printf=
avrdbopti.build.optimizationlevel=-Os
avrdbopti.build.gcse=
avrdbopti.build.attachmode=-DCORE_ATTACH_ALL

