SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdbopti.bootloader.tool=avrdude
avrdbopti.bootloader.defaultentrycond=_extrf
avrdbopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrdbopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdbopti.bootloader.wdtwindowbits=0000
avrdbopti.bootloader.wdttimeotbits=0000
avrdbopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdbopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdbopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdbopti.bootloader.CODESIZE=0x00
avrdbopti.bootloader.BOOTSIZE=0x01
avrdbopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdbopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdbopti.upload.tool=avrdude
avrdbopti.upload.protocol=arduino
avrdbopti.upload.extra_params=-D
avrdbopti.upload.speed=115200
avrdbopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards as it is guaranteed run correctly"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdbopti.build.mcupostfix=opti
avrdbopti.build.printfabr=
avrdbopti.build.optabr=.Os
avrdbopti.build.attachabr=
avrdbopti.build.wireabr=
avrdbopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdbopti.menu.chip.avr128db28=AVR128DB28
avrdbopti.menu.chip.avr128db28.build.mcu=avr128db28
avrdbopti.menu.chip.avr128db28.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db28.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db28.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr128db32=AVR128DB32
avrdbopti.menu.chip.avr128db32.build.mcu=avr128db32
avrdbopti.menu.chip.avr128db32.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db32.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db32.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr128db48=AVR128DB48
avrdbopti.menu.chip.avr128db48.build.mcu=avr128db48
avrdbopti.menu.chip.avr128db48.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db48.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db48.build.variant=48pin-standard
avrdbopti.menu.chip.avr128db64=AVR128DB64
avrdbopti.menu.chip.avr128db64.build.mcu=avr128db64
avrdbopti.menu.chip.avr128db64.bootloader.class=optiboot_128dx
avrdbopti.menu.chip.avr128db64.upload.maximum_size=130560
avrdbopti.menu.chip.avr128db64.upload.maximum_data_size=16384
avrdbopti.menu.chip.avr128db64.build.variant=64pin-standard
avrdbopti.menu.chip.avr64db28=AVR64DB28
avrdbopti.menu.chip.avr64db28.build.mcu=avr64db28
avrdbopti.menu.chip.avr64db28.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db28.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db28.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr64db32=AVR64DB32
avrdbopti.menu.chip.avr64db32.build.mcu=avr64db32
avrdbopti.menu.chip.avr64db32.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db32.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db32.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr64db48=AVR64DB48
avrdbopti.menu.chip.avr64db48.build.mcu=avr64db48
avrdbopti.menu.chip.avr64db48.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db48.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db48.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db48.build.variant=48pin-standard
avrdbopti.menu.chip.avr64db64=AVR64DB64
avrdbopti.menu.chip.avr64db64.build.mcu=avr64db64
avrdbopti.menu.chip.avr64db64.bootloader.class=optiboot_64dx
avrdbopti.menu.chip.avr64db64.upload.maximum_size=65024
avrdbopti.menu.chip.avr64db64.upload.maximum_data_size=8192
avrdbopti.menu.chip.avr64db64.build.variant=64pin-standard
avrdbopti.menu.chip.avr32db28=AVR32DB28
avrdbopti.menu.chip.avr32db28.build.mcu=avr32db28
avrdbopti.menu.chip.avr32db28.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db28.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db28.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db28.build.variant=28pin-standard
avrdbopti.menu.chip.avr32db32=AVR32DB32
avrdbopti.menu.chip.avr32db32.build.mcu=avr32db32
avrdbopti.menu.chip.avr32db32.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db32.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db32.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db32.build.variant=32pin-standard
avrdbopti.menu.chip.avr32db48=AVR32DB48
avrdbopti.menu.chip.avr32db48.build.mcu=avr32db48
avrdbopti.menu.chip.avr32db48.bootloader.class=optiboot_32dx
avrdbopti.menu.chip.avr32db48.upload.maximum_size=32256
avrdbopti.menu.chip.avr32db48.upload.maximum_data_size=4096
avrdbopti.menu.chip.avr32db48.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdbopti.menu.clock.24internal=24 MHz internal
avrdbopti.menu.clock.24internal.build.speed=24
avrdbopti.menu.clock.24internal.build.clocksource=0
avrdbopti.menu.clock.20internal=20 MHz internal
avrdbopti.menu.clock.20internal.build.speed=20
avrdbopti.menu.clock.20internal.build.clocksource=0
avrdbopti.menu.clock.16internal=16 MHz internal
avrdbopti.menu.clock.16internal.build.speed=16
avrdbopti.menu.clock.16internal.build.clocksource=0
avrdbopti.menu.clock.12internal=12 MHz internal
avrdbopti.menu.clock.12internal.build.speed=12
avrdbopti.menu.clock.12internal.build.clocksource=0
avrdbopti.menu.clock.10internal=10 MHz internal
avrdbopti.menu.clock.10internal.build.speed=10
avrdbopti.menu.clock.10internal.build.clocksource=0
avrdbopti.menu.clock.8internal=8 MHz internal
avrdbopti.menu.clock.8internal.build.speed=8
avrdbopti.menu.clock.8internal.build.clocksource=0
avrdbopti.menu.clock.5internal=5 MHz internal
avrdbopti.menu.clock.5internal.build.speed=5
avrdbopti.menu.clock.5internal.build.clocksource=0
avrdbopti.menu.clock.4internal=4 MHz internal
avrdbopti.menu.clock.4internal.build.speed=4
avrdbopti.menu.clock.4internal.build.clocksource=0
avrdbopti.menu.clock.1internal=1 MHz internal
avrdbopti.menu.clock.1internal.build.speed=1
avrdbopti.menu.clock.1internal.build.clocksource=0
avrdbopti.menu.clock.24crystal=24 MHz crystal
avrdbopti.menu.clock.24crystal.build.speed=24
avrdbopti.menu.clock.24crystal.build.clocksource=1
avrdbopti.menu.clock.20crystal=20 MHz crystal
avrdbopti.menu.clock.20crystal.build.speed=20
avrdbopti.menu.clock.20crystal.build.clocksource=1
avrdbopti.menu.clock.16crystal=16 MHz crystal
avrdbopti.menu.clock.16crystal.build.speed=16
avrdbopti.menu.clock.16crystal.build.clocksource=1
avrdbopti.menu.clock.12crystal=12 MHz crystal
avrdbopti.menu.clock.12crystal.build.speed=12
avrdbopti.menu.clock.12crystal.build.clocksource=1
avrdbopti.menu.clock.8crystal=8 MHz crystal
avrdbopti.menu.clock.8crystal.build.speed=8
avrdbopti.menu.clock.8crystal.build.clocksource=1
avrdbopti.menu.clock.24extclock=24 MHz ext. clock
avrdbopti.menu.clock.24extclock.build.speed=24
avrdbopti.menu.clock.24extclock.build.clocksource=2
avrdbopti.menu.clock.20extclock=20 MHz ext. clock
avrdbopti.menu.clock.20extclock.build.speed=20
avrdbopti.menu.clock.20extclock.build.clocksource=2
avrdbopti.menu.clock.16extclock=16 MHz ext. clock
avrdbopti.menu.clock.16extclock.build.speed=16
avrdbopti.menu.clock.16extclock.build.clocksource=2
avrdbopti.menu.clock.12extclock=12 MHz ext. clock
avrdbopti.menu.clock.12extclock.build.speed=12
avrdbopti.menu.clock.12extclock.build.clocksource=2
avrdbopti.menu.clock.8extclock=8 MHz ext. clock
avrdbopti.menu.clock.8extclock.build.speed=8
avrdbopti.menu.clock.8extclock.build.clocksource=2
avrdbopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdbopti.menu.clock.28internal.build.speed=28
avrdbopti.menu.clock.28internal.build.clocksource=0
avrdbopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdbopti.menu.clock.32internal.build.speed=32
avrdbopti.menu.clock.32internal.build.clocksource=0
avrdbopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
avrdbopti.menu.clock.25crystal.build.speed=25
avrdbopti.menu.clock.25crystal.build.clocksource=1
avrdbopti.menu.clock.27crystal=27 MHz crystal (overclocked)
avrdbopti.menu.clock.27crystal.build.speed=27
avrdbopti.menu.clock.27crystal.build.clocksource=1
avrdbopti.menu.clock.28crystal=28 MHz crystal (overclocked)
avrdbopti.menu.clock.28crystal.build.speed=28
avrdbopti.menu.clock.28crystal.build.clocksource=1
avrdbopti.menu.clock.30crystal=30 MHz ext. clock (overclocked)
avrdbopti.menu.clock.30crystal.build.speed=30
avrdbopti.menu.clock.30crystal.build.clocksource=1
avrdbopti.menu.clock.32crystal=32 MHz crystal (overclocked)
avrdbopti.menu.clock.32crystal.build.speed=32
avrdbopti.menu.clock.32crystal.build.clocksource=1
avrdbopti.menu.clock.36crystal=36 MHz crystal (highly overclocked)
avrdbopti.menu.clock.36crystal.build.speed=36
avrdbopti.menu.clock.36crystal.build.clocksource=1
avrdbopti.menu.clock.40crystal=40 MHz crystal (highly overclocked)
avrdbopti.menu.clock.40crystal.build.speed=40
avrdbopti.menu.clock.40crystal.build.clocksource=1
avrdbopti.menu.clock.48crystal=48 MHz crystal (are you nuts?!)
avrdbopti.menu.clock.48crystal.build.speed=48
avrdbopti.menu.clock.48crystal.build.clocksource=1
avrdbopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdbopti.menu.clock.25extclock.build.speed=25
avrdbopti.menu.clock.25extclock.build.clocksource=2
avrdbopti.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrdbopti.menu.clock.27extclock.build.speed=27
avrdbopti.menu.clock.27extclock.build.clocksource=2
avrdbopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdbopti.menu.clock.28extclock.build.speed=28
avrdbopti.menu.clock.28extclock.build.clocksource=2
avrdbopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdbopti.menu.clock.30extclock.build.speed=30
avrdbopti.menu.clock.30extclock.build.clocksource=2
avrdbopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdbopti.menu.clock.32extclock.build.speed=32
avrdbopti.menu.clock.32extclock.build.clocksource=2
avrdbopti.menu.clock.36extclock=36 MHz ext. clock (highly overclocked)
avrdbopti.menu.clock.36extclock.build.speed=36
avrdbopti.menu.clock.36extclock.build.clocksource=2
avrdbopti.menu.clock.40extclock=40 MHz ext. clock (highly overclocked)
avrdbopti.menu.clock.40extclock.build.speed=40
avrdbopti.menu.clock.40extclock.build.clocksource=2
avrdbopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdbopti.menu.clock.48extclock.build.speed=48
avrdbopti.menu.clock.48extclock.build.clocksource=2

